readme.org
#+TITLE: Doom Emacs Configuration

#+PROPERTY: header-args    :tangle config.el

My personal doom emacs configuration.

* Reference

[[https://github.com/doomemacs/doomemacs/blob/master/docs/getting_started.org][doom - getting started]]

[[https://docs.doomemacs.org/latest/][Documentation - Doom Emacs latest documentation]]

* Non-standard binds
** global map

| key       | command                     |
|-----------+-----------------------------|
| ~v~ ~V~   | expand/contract region      |
| ~SPC s o~ | consult-outline             |
| ~SPC s f~ | consult-find                |
| ~SPC s y~ | consult-yank-from-kill-ring |
| SPC b o   | consult-buffer-other-window |
| SPC r l   | consult-register-load       |
| SPC r s   | consult-register-store      |
| SPC r r   | consult-register            |
| ~M-SPC~   | cycle-spacing               |
| ~SPC t m~ | style/max-frame             |
| ~SPC t d~ | style/default-frame         |
| ~gss~     | evil-avy-goto-char-timer    |
| ~gs/~     | evil-avy-goto-char-2        |
| ~C-r~     | isearch-backwards           |
| ~M-s-s~   | isearch-forward-regexp      |
| ~M-j~     | avy-isearch                 |
| M-n       | flycheck-next-error         |
| M-p       | flycheck-previous-error     |
|           |                             |

** org map

| ~SPC m l p~ | org-hugo-export-wim-to-md |
| ~SPC m z~   | yank into block commands  |
| SPC m j   | org-random-todo-goto-new  |
|           |                           |

** haskell-ng map

| M-n       | flycheck-next-error     |
| M-p       | flycheck-prev-error     |
| SPC m h   | hoogle-name             |
| SPC m p   | hackage-package         |
| SPC m '   | haskell-ng-repl-run     |
| SPC m = = | ormolu-format-buffer    |
| SPC m e e | eglot                   |
| SPC m l l | lsp                     |
| SPC m l r | lsp-restart             |
| SPC m l f | consult-flycheck        |
| SPC m l i | toggle-import-lens-code |
| SPC m l s | lsp-ui-sideline-mode    |
| SPC m l m | lsp-toggle-mouse-docs   |
| SPC m l q | lsp-workspace-shutdown  |
| SPC m = = | cabal-format-buffer     |
| SPC m = r | cabal-format-region     |
|           |                         |

* Configuration Examples

Most of my doom config, and much of my work flow has been put together from reading and stealing from other configs.

A useful technique is to do an advanced github search of these repos, together with the main doom-emacs repository. An example:

[[https://github.com/search?q=vertico+(repo%3Adoomemacs%2Fdoomemacs+OR+repo%3Ahlissner%2F.doom.d+OR+repo%3Afloscr%2Femacs.d+OR+repo%3ALemonBreezes%2Fcyber-angel-emacs+OR+repo%3Adangirsh%2F.doom.d+OR+repo%3Atecosaur%2Femacs-config+OR+repo%3Azzamboni%2Fdot-emacs+OR+repo%3AMatthewZMD%2F.emacs.d+OR+repo%3Akarthink%2F.emacs.d+OR+repo%3Aprotesilaos%2Fdotfiles+OR+repo%3Asachac%2F.emacs.d)&type=code&ref=advsearch][Example search on vertico]]

** doom'ish

[[https://github.com/LemonBreezes/cae-emacs][LemonBreezes]]

[[https://github.com/floscr/emacs.d][floscr]]

[[https://github.com/dangirsh/.doom.d][dangirsh]]

[[https://github.com/hlissner/doom-emacs-private][hlissner]]

[[https://github.com/tecosaur/emacs-config/][tecosaur]]

[[https://github.com/zzamboni/dot-doom/][zzamboni]]

** from-scratch'ish

[[https://github.com/sachac/.emacs.d][sachac]]

[[https://github.com/MatthewZMD/.emacs.d][MatthewZMD]]

[[https://github.com/karthink/.emacs.d][karthink]]

[[https://github.com/protesilaos/dotfiles][protesilaos]]

** haskell'ish

[[https://gitlab.com/magus/mes][magus]]

* Default

As per default doom config.el.

[[https://elpa.gnu.org/packages/doc/modus-themes.html#Fringes][Modus themes for GNU Emacs]]
[[https://protesilaos.com/emacs/modus-themes][Modus Themes (Modus Operandi and Modus Vivendi) | Protesilaos Stavrou]]
[[https://protesilaos.com/emacs/ef-themes#h:ac76ded0-af9b-4566-aff9-75142ef2d4ef][Ef (εὖ) themes for GNU Emacs | Protesilaos Stavrou]]

#+begin_src elisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; other configuration examples
;;

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Tony Day"
      user-mail-address "tonyday567@gmail.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;    presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;;(setq doom-font (font-spec :family "Iosevka ss02" :size 14 :weight 'light)
;;      doom-variable-pitch-font (font-spec :family "Iosevka etoile" :size 14))
;;(setq doom-font (font-spec :family "Victor Mono")
;;      doom-variable-pitch-font (font-spec :family "Iosevka Aile"))

(setq doom-font (font-spec :family "Victor Mono"))
(setq doom-variable-pitch-font (font-spec :family "Iosevka Aile"))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; (setq doom-theme 'doom-Iosvkem)
;; (setq doom-theme 'modus-vivendi)
(setq doom-theme 'ef-bio)
;; (doom-themes-org-config)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type nil)

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

#+end_src

* Themes

** ef-themes

#+begin_src elisp
(use-package! ef-themes
  :config
  (setq ef-themes-to-toggle '(ef-bio ef-dark))
  (map! :leader "te" #'ef-themes-toggle)
  (mapc #'disable-theme custom-enabled-themes)
  (ef-themes-select 'ef-bio))
#+end_src

* Doom

Global and standard doom library tweaks.

** globals

#+begin_src elisp
(setq confirm-kill-emacs nil
      confirm-kill-processes nil)

;; setq-default sets variables that are usually local to buffers
(setq-default truncate-lines nil
              indent-tabs-mode nil)

(map! ;; removes from kill ring
      [remap backward-kill-word] #'doom/delete-backward-word
      ;; replaces just-one-space
      "M-SPC" #'cycle-spacing
      [remap ibuffer] #'ibuffer-jump)

#+end_src

** doom-modeline

#+begin_src elisp
(setq doom-modeline-lsp-icon nil)
(setq doom-modeline-buffer-encoding nil)
(setq doom-modeline-buffer-state-icon nil)
(setq doom-modeline-vcs-max-length 8)
(setq doom-modeline-lsp nil)
(setq doom-modeline-modal nil)
#+end_src

** default frame

#+begin_src elisp
(defun style/left-frame ()
  (interactive)
  (cond
   ((string-equal system-type "windows-nt") ; Microsoft Windows
    (progn
      (set-frame-parameter (selected-frame) 'fullscreen nil)
      (set-frame-parameter (selected-frame) 'vertical-scroll-bars nil)
      (set-frame-parameter (selected-frame) 'horizontal-scroll-bars nil)
      (set-frame-parameter (selected-frame) 'top 10)
      (set-frame-parameter (selected-frame) 'left 6)
      (set-frame-parameter (selected-frame) 'height 40)
      (set-frame-parameter (selected-frame) 'width 120)))
   ((string-equal system-type "darwin") ; Mac OS X
    (progn
      (set-frame-parameter (selected-frame) 'fullscreen nil)
      (set-frame-parameter (selected-frame) 'vertical-scroll-bars nil)
      (set-frame-parameter (selected-frame) 'horizontal-scroll-bars nil)
      (set-frame-parameter (selected-frame) 'top 23)
      (set-frame-parameter (selected-frame) 'left 0)
      (set-frame-parameter (selected-frame) 'height 44)
      (set-frame-parameter (selected-frame) 'width 100)
      (message "default-frame set")))
   ((string-equal system-type "gnu/linux") ; linux
    (progn
      (message "Linux")))))

(add-to-list 'initial-frame-alist '(top . 23))
(add-to-list 'initial-frame-alist '(left . 0))
(add-to-list 'initial-frame-alist '(height . 44))
(add-to-list 'initial-frame-alist '(width . 100))

(defun style/max-frame ()
  (interactive)
  (if t
      (progn
        (set-frame-parameter (selected-frame) 'fullscreen 'fullboth)
        (set-frame-parameter (selected-frame) 'vertical-scroll-bars nil)
        (set-frame-parameter (selected-frame) 'horizontal-scroll-bars nil))
    (set-frame-parameter (selected-frame) 'top 26)
    (set-frame-parameter (selected-frame) 'left 2)
    (set-frame-parameter (selected-frame) 'width
                         (floor (/ (float (x-display-pixel-width)) 9.15)))
    (if (= 1050 (x-display-pixel-height))
        (set-frame-parameter (selected-frame) 'height
                             (if (>= emacs-major-version 24)
                                 66
                               55))
      (set-frame-parameter (selected-frame) 'height
                           (if (>= emacs-major-version 24)
                               75
                             64)))))

(style/left-frame)  ;; Focus new window after splitting
(map!
   :leader
   :nvm "tm" #'style/max-frame
   :nvm "td" #'style/left-frame)
#+end_src

